import 'package:flutter/material.dart';
import 'package:swipable/data/data.dart';

class UpdateQst extends StatelessWidget {
  List<List> questions = [
    ["مفهوم استعمله رئيس وزراء بريطانيا ونستون تشرشل لما تحدث عن أطماع الاتحاد السوفياتي التوسعية في أوروبا الشرقية"," الستار الحديدي", " الستار الشيوعي"," التوسع السوفيتي","الجدار العازل"],
    ["صراع فكري حضاري بين الشيوعية و الرأسمالية بحيث يحبذ كل منها القضاء على الأخر و فرض مذهبه عليه"," الصراع الاديولوجي", " الحرب الباردة"," صراع ملء الفراغ","سياسة الاحتواء"],
    ["هي سياسة استعمارية تبنتها الولايات المتحدة الأمريكية و وظفتها بعد ضعف و انسحاب قوى الاستعمارية التقليدية"," ملء الفراغ", "  التوسع"," سباق التسلح","سياسة التكتل"],
    ["توازن عسكري نووي دولي منبثق من امتلاك كل من الو م أ و الإتحاد السوفياتي للسلاح النووي تستطيع بها تدمير القوة الأخرى"," توازن الرعب", "  سباق التسلح"," تشكل الاحلاف","نظام القطبية"],
    ["مشروع مارشال لتقديم مساعدات مالية لاوربا"," 1947", "  1952"," 1962","1919"],
    ["هو الرد على مشروع مارشال الأمريكي و يعرف بمشروع بلشفة أوربا الشرقية"," مبدأ جدا نوف", " مبدأ ايزنهاور "," مبدأ غورباتشوف","قانون الكومنفورم"],

  ];
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: Container(
        child: RaisedButton(child: Text('add qst'),onPressed: (){
          DatabaseService().updateQst(questions)  ;
        },),
      ),
    );
  }
}
